[Abilities.A_Wormor_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="能量释放"
mTooltip="向一个城防设施开火，造成 %d.min 到 %d.max %ICON_PRIME 源力伤害。"

[Abilities.A_Wormor_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Abilities.A_Wormor_Support H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="蠕虫牺牲自己，治疗并复活所有友方单位（包括构装体）%d2.max 生命值（亡灵除外）。"
mName="星界牺牲"
mTooltip="蠕虫牺牲自己，治疗并复活所有友方单位（包括构装体）%d1.max 生命值（亡灵除外）。"

[Abilities.A_Sealstone_Charge H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="充能"
mTooltip="封印石将进行充能而不是攻击。每场战斗只能使用一次。在下个回合，它将获得 %spell1.name 能力（封印石释放所有能量，使敌方单位遭受随机的负面效果）。"

[Abilities.A_Sealstone_LevelProgress H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战争技能"
mTooltip=""

[Abilities.A_Sealstone_Overload H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="过载"
mTooltip="封印石释放所有能量，使敌方单位遭受随机的负面效果。"

[Creatures.A_Wormor H7EditorWarUnit]
mDesc="攻击与支援型战争单位"
mName="蠕魔"
mLore="蠕魔是秽巢在恢复全部力量后召唤到蒙达拉尔的生物。它们是星界蠕虫，能够将能量集中成强大的爆炸，从而损坏城墙。它们最初计划用于对抗敌军，但其能量冲击对移动目标效果不佳。如果蠕魔的身体被摧毁，防御机制会启动，整个蠕虫会因其在下方的时空裂隙而沉入地面。然而，再生过程需要时间，它将能够恢复全部力量直至下次战斗。如果主人要求，它能够牺牲自己（造成巨大伤害并消失在裂隙中），并用剩余的能量治疗、复活友方单位甚至修复机械。"

[Creatures.A_Sealstone H7EditorWarUnit]
mDesc="攻击与支援型战争单位"
mName="封印石"
mLore="封印石可以追溯到蒙达拉尔守护苏尔的时期，他们能够通过这些神器在长距离快速传输信息。同时，这些石头就像是苏尔任何人可以传送到的“信标”。然而，随着时间的推移，它们逐渐被废弃，直到最终停用，留在蒙达拉尔作为风景装饰。当巨大的风暴席卷世界之夜，秽巢实体苏醒时，这些石头被激活了。然而，秽巢辐射使它们变成了能够逐渐削弱对手的有效武器。每块石头可以充能然后释放，削弱所有敌方单位。但这个过程非常耗能，每场战斗只能使用一次。"

___________________________

1.30版本：

[Abilities.A_Sealstone_Attack H7WarfareAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="诅咒封印"
mTooltip="造成 %d %icon_prime 源力伤害，并移除目标的一个正面效果。"